InformationRegisters/Renault_ТикетыAp2Ap.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ТикетыAp2Ap</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТикетВыполнен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОшибкаВыполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибкиВыполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Тикет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_ТикетыAp2Ap/Ext/ManagerModule.bsl
////@+ Процедура ЗаписатьРезультат(РезультатЗапроса, Тикет)
// Дата создания - 19.04.2012 11:22:46;
// Автор - Окипний Андрей Евгеньевич
// 
// Описание процедуры
//  Процедура записи результата выполнения тикета.
//
// Параметры
//  Парам1 РезультатЗапроса  - Строка - XML с результатом запроса
//
//  Парам2 Тикет  - Строка(16) - НомерТикета, в который необходимо положить результат
//
//@-
Процедура ЗаписатьРезультат(РезультатЗапроса, Тикет) Экспорт

	// Комментарий 
	//Дата создания - 19.04.2012 11:25:08; Автор - Окипний Андрей Евгеньевич
	//Нужно найти созданный тикет
	//
	МЗ = СоздатьМенеджерЗаписи();
	
	МЗ.Тикет = Тикет;
	
	// Комментарий 
	//Дата создания - 19.04.2012 11:26:51; Автор - Окипний Андрей Евгеньевич
	//Считываем запись из регистра
	//
	МЗ.Прочитать();
	
	// Комментарий 
	//Дата создания - 19.04.2012 11:27:11; Автор - Окипний Андрей Евгеньевич
	//Устанавливаем новые значения реквизитов
	//
	РезультатВХранилище = Новый ХранилищеЗначения(РезультатЗапроса, Новый СжатиеДанных(9));
	
	МЗ.Результат = РезультатВХранилище;
	МЗ.ТикетВыполнен = Истина;
	МЗ.ОшибкаВыполнения = Ложь;
	
	// Комментарий 
	//Дата создания - 19.04.2012 11:28:10; Автор - Окипний Андрей Евгеньевич
	//Сохраняем результат
	//
	МЗ.Записать();
	
КонецПроцедуры // ЗаписатьРезультат(РезультатЗапроса, Тикет)

////@+ Процедура ЗаписатьОшибкуВТикет(Тикет)
// Дата создания - 19.04.2012 11:36:01; 
// Автор - Окипний Андрей Евгеньевич
// 
// Описание процедуры
//  Процедура записывает ошибку выполнения в тикет
//
// Параметры
//  Парам1 Тикет  - Строка(16) - НомерТикета, в котором необходимо отметить ошибку 
//  выполнения
//@-
Процедура ЗаписатьОшибкуВТикет(Тикет, ОписаниеОшибки = "") Экспорт

	МЗ = СоздатьМенеджерЗаписи();
	
	МЗ.Тикет = Тикет;
	
	// Комментарий 
	//Дата создания - 19.04.2012 11:37:59; Автор - Окипний Андрей Евгеньевич
	//Считываем запись из регистра
	//
	МЗ.Прочитать();
	
	// Комментарий 
	//Дата создания - 19.04.2012 11:38:15; Автор - Окипний Андрей Евгеньевич
	//Устанавливаем новые значения реквизитов
	//
	МЗ.ТикетВыполнен = Истина;
	МЗ.ОшибкаВыполнения = Истина;
	МЗ.ОписаниеОшибкиВыполнения = ОписаниеОшибки;
	
	// Комментарий 
	//Дата создания - 19.04.2012 11:38:27; Автор - Окипний Андрей Евгеньевич
	//Сохраняем результат
	//
	МЗ.Записать();


КонецПроцедуры // ЗаписатьОшибкуВТикет(Тикет)

////@+ Функция СоздатьНовыйТикет()
// Дата создания - 19.04.2012 11:39:15;
// Автор - Окипний Андрей Евгеньевич
//
// Описание функции
//  Функция создает новый тимкет в регистре
//
// Параметры
//  Без параметров
//
// Возвращаемое значение
//  Тикет  - Строка(16) - Номер тикета в формате ГГГГММДДччммсс
//
//@-
Функция СоздатьНовыйТикет() Экспорт
	
	//Первоначальная инициализация
	Тикет = неопределено;
	
	Тикет = Формат(ТекущаяДата(),"ДФ=ггггММддччммсс");
	
	// Комментарий 
	//Дата создания - 19.04.2012 11:41:59; Автор - Окипний Андрей Евгеньевич
	//создаем менеджер записи
	//
	МЗ = СоздатьМенеджерЗаписи();
	МЗ.Тикет = Тикет;
	МЗ.Прочитать();
	
	МЗ.Тикет = Тикет;
	МЗ.Записать();
	
	
	Возврат Тикет;
КонецФункции // СоздатьНовыйТикет()
